Repository: guilhermesalvi/zoe-ms-identity-access
Catalog: src/Zoe.IdentityAccess.Api/LocalizationResources/SharedResource.*.resx
Languages: pt_br

# ACCOUNT_EMPTY_CONFIRM_PASSWORD
source: Password confirmation should be informed.
pt_br: A confirmação de senha deve ser informada.

# ACCOUNT_EMPTY_FULL_NAME
source: The full name should be informed
pt_br: O nome completo deve ser informado.

# ACCOUNT_EMPTY_PASSWORD
source: The password should be informed
pt_br: A senha deve ser informada.

# ACCOUNT_EMPTY_PREFERRED_NAME
source: The preferred name should be informed.
pt_br: O nome de preferência deve ser informado.

# ACCOUNT_EMPTY_USER_EMAIL
source: The email should be informed.
pt_br: O email deve ser informado.

# ACCOUNT_INVALID_CONFIRM_PASSWORD
source: The password and its confirmation should be the same.
pt_br: A senha e sua confirmação devem ser iguais.

# ACCOUNT_INVALID_EMAIL_FORMAT
source: The email should be a valid email address.
pt_br: O email deve ser um endereço de email válido.

# ACCOUNT_INVALID_EMAIL_LENGTH
source: The email should be between 5 and 100 characters.
pt_br: O email deve ter entre 5 e 100 caracteres.

# ACCOUNT_INVALID_FULL_NAME_FORMAT
source: The name should consist of alphabetic characters only.
pt_br: O nome deve ser composto apenas por caracteres alfabéticos.

# ACCOUNT_INVALID_FULL_NAME_LENGTH
source: The name should be between 5 and 100 characters.
pt_br: O nome deve ter entre 5 e 100 caracteres.

# ACCOUNT_INVALID_PASSWORD_LENGTH
source: The password should be between 5 and 100 characters.
pt_br: A senha deve ter entre 5 e 100 caracteres.

# ACCOUNT_INVALID_PREFERRED_NAME_FORMAT
source: The preferred name should consist of alphabetic characters only.
pt_br: O nome de preferência deve ser composto apenas por caracteres alfabéticos.

# ACCOUNT_INVALID_PREFERRED_NAME_LENGTH
source: The preference name must be between 2 and 30 characters.
pt_br: O nome de preferência deve ter entre 2 e 30 caracteres.

# ACCOUNT_USER_CREATED_SUCCESSFULLY
source: User successfully registered.
pt_br: Usuário registrado com sucesso.

# DEFAULT_API_ERROR
source: We had a problem during processing data.
pt_br: Tivemos um problema durante o processamento dos dados.

# IDENTITY_CONCURRENCY_FAILURE
source: Optimistic concurrency failure, object has been modified.
pt_br: Falha de concorrência otimista, o objeto foi modificado.

# IDENTITY_DEFAULT_ERROR
source: An unknown failure has occurred.
pt_br: Ocorreu um erro desconhecido.

# IDENTITY_DUPLICATE_EMAIL
source: Email is already taken.
pt_br: Este email já está sendo utilizado.

# IDENTITY_DUPLICATE_ROLE_NAME
source: Role name is already taken.
pt_br: A permissão já está sendo utilizada.

# IDENTITY_DUPLICATE_USER_NAME
source: User name is already taken.
pt_br: Este login já está sendo utilizado.

# IDENTITY_INVALID_EMAIL
source: Email is invalid.
pt_br: Email inválido.

# IDENTITY_INVALID_ROLE_NAME
source: Role name is invalid.
pt_br: A permissão é inválida.

# IDENTITY_INVALID_TOKEN
source: Invalid token.
pt_br: Token inválido.

# IDENTITY_INVALID_USER_NAME
source: User name is invalid, can only contain letters or digits.
pt_br: Login inválido, deve conter apenas letras ou dígitos.

# IDENTITY_LOGIN_ALREADY_ASSOCIATED
source: A user with this login already exists.
pt_br: Já existe um usuário com este login.

# IDENTITY_PASSWORD_MISMATCH
source: Incorrect password.
pt_br: Senha incorreta.

# IDENTITY_PASSWORD_REQUIRES_DIGIT
source: Passwords must have at least one digit ('0'-'9').
pt_br: As senhas devem conter ao menos um digito ('0'-'9').

# IDENTITY_PASSWORD_REQUIRES_LOWER
source: Passwords must have at least one lowercase ('a'-'z').
pt_br: As senhas devem conter ao menos um caracter em caixa baixa ('a'-'z').

# IDENTITY_PASSWORD_REQUIRES_NON_ALPHANUMERIC
source: Passwords must have at least one non alphanumeric character.
pt_br: As senhas devem conter ao menos um caracter não alfanumérico.

# IDENTITY_PASSWORD_REQUIRES_UPPER
source: Passwords must have at least one uppercase ('A'-'Z').
pt_br: As senhas devem conter ao menos um caracter em caixa alta ('A'-'Z').

# IDENTITY_PASSWORD_TOO_SHORT
source: Passwords must be at least 6 characters.
pt_br: As senhas devem conter ao menos 6 caracteres.

# IDENTITY_USER_ALREADY_HAS_PASSWORD
source: User already has a password set.
pt_br: O usuário já possui uma senha definida.

# IDENTITY_USER_ALREADY_IN_ROLE
source: User already in role.
pt_br: O usuário já possui a permissão.

# IDENTITY_USER_LOCKOUT_NOT_ENABLED
source: Lockout is not enabled for this user.
pt_br: Lockout não está habilitado para este usuário.

# IDENTITY_USER_NOT_IN_ROLE
source: User is not in role.
pt_br: O usuário não tem a permissão.
